//상품 입력 개수를 입력하시오 : 3
//* ****상품 추가 / 수정 / 출력 * ****
//메뉴 입력
//1)상품추가
//2)상품수정
//3)종합출력
//4)상품출력
//5)종료
//>> 1
//상품명 : 공기청정기
//	상품가 : 420000
//	상품 입력 완료
//	2개의 추가 상품 입력이 가능합니다.
//
//	***** 상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 1
//	상품명 : 가습기
//	상품가 : 220000
//	상품 입력 완료
//	1개의 추가 상품 입력이 가능합니다.
//
//
//	***** 상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 3
//	모든 상품 출력
//	[0] 번
//	상품 : 공기청정기
//	금액 : 420000
//
//	[1] 번
//	상품 : 가습기
//	금액 : 220000
//
//
//	* ****상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 4
//	출력 상품 번호 : 2
//	상품 번호 오류입니다.
//
//
//	***** 상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 4
//	출력 상품 번호 : 1
//	[1] 번째 상품 정보
//	상품 : 가습기
//	금액 : 220000
//
//	* ****상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 3
//	모든 상품 출력
//	[0] 번
//	상품 : 공기청정기
//	금액 : 420000
//
//	[1] 번
//	상품 : 가습기
//	금액 : 220000
//
//
//	* ****상품 추가 / 수정 / 출력 * ****
//	메뉴 입력
//	1)상품추가
//	2)상품수정
//	3)종합출력
//	4)상품출력
//	5)종료
//	>> 5
//	프로그램을 종료 합니다.
//
//	Product 객체 소멸
//	Product 객체 소멸
//	계속하려면 아무 키나 누르십시오 . . .